// ConsoleApplication5.cpp : Этот файл содержит функцию "main". Здесь начинается
// и заканчивается выполнение программы.
//

#include <iostream>

int main() {
  int a;
  std::cout << "Write a number" << std::endl;
  std::cin >> a;

  while (a > 1) {
    if (a % 2 == 0) {
      a /= 2;
      std::cout << "Divide in half and we get >> " << a << std::endl;
    } else {
      a *= 3;
      a++;
      std::cout << "Multiply in 3 times and add 1 and we get >> " << a
                << std::endl;
    }
  }

  std::cout << "Result is >> " << a;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и
//   другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый
//   элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий
//   элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" >
//   "Открыть" > "Проект" и выберите SLN-файл.
