// pch.h: это предварительно скомпилированный заголовочный файл.
// Перечисленные ниже файлы компилируются только один раз, что ускоряет последующие сборки.
// Это также влияет на работу IntelliSense, включая многие функции просмотра и завершения кода.
// Однако изменение любого из этих файлов приведет к повторной компиляции всех файлов, которые их включают.
// Не добавляйте сюда файлы, которые планируете часто изменять.

#ifndef PCH_H
#define PCH_H

// Добавьте сюда заголовочные файлы, предварительную компиляцию которых вы хотите выполнить.

#endif // PCH_H